{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**№ 7826 (Уровень: Базовый)\n",
    "(М. Ишимов)**  В парке развлечений есть K аттракционов. Все аттракционы пронумерованы, начиная с единицы. Известно время, в которое каждый посетитель хочет начать свою поездку на аттракционе, и в какое время он закончит кататься на нём. Аттракцион считается свободным, если на нём никто не катается. Каждый посетитель должен выбрать свободный аттракцион с наименьшим номером. Если в момент прихода посетителя все аттракционы заняты, то посетитель уходит, не дожидаясь освобождения одной из них. Если некоторые посетители придут в парк одновременно, они будут кататься на одном и том же аттракционе вместе. Для того, чтобы остановить и запустить аттракцион заново, необходима 1 минута. Со следующей минуты следующие посетители могут воспользоваться аттракционом. Каждый посетитель за весь день может покататься только на одном аттракционе.\n",
    "\n",
    "Определите, наибольшее количество посетителей, которые придут в парк и покатаются на аттракционах за 24 часа и номер аттракциона, на котором прокатится последний посетитель.\n",
    "\n",
    "Входные данные\n",
    "\n",
    "В первой строке входного файла находится два числа K – количество аттракционов в парке развлечений и N – количество посетителей, которые придут в этот парк (натуральные числа, не превышающее 2000). В следующих N строках находятся два значения: минута прихода и минута, не раньше которой посетитель закончит кататься на аттракционе, отсчёт ведётся от начала суток (все числа неотрицательные, не превышающие 1440), для каждого посетителя – в отдельной строке.\n",
    "\n",
    "Запишите в ответе два целых числа: сначала количество посетителей, которое сможет воспользоваться аттракционами в парке развлечений за 24 часа, затем номер аттракциона, на котором прокатится последний посетитель.\n",
    "\n",
    "Типовой пример организации данных во входном файле\n",
    "\n",
    "2 6\n",
    "30 60\n",
    "61 120\n",
    "79 160\n",
    "79 180\n",
    "100 130\n",
    "170 1440\n",
    "\n",
    "При таких исходных данных 1-ый, 2-ой, 3-ий, 4-ый и 6-ой посетители смогут воспользоваться аттракционами. Последний турист сможет прокатиться на первом аттракционе.\n",
    "\n",
    "Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "210 1000 [[1, 660], [2, 780], [6, 699], [7, 712], [7, 489]]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "(743, 190)"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def pp(t):\n",
    "    print(*range(0, 1441), sep='\\t')\n",
    "    for i in t:\n",
    "        print(*i, sep='\\t')\n",
    "    \n",
    "\n",
    "f = open('26_7826.txt')\n",
    "\n",
    "k, n = list(map(int, f.readline().split()))\n",
    "m = [list(map(int, i.split())) for i in f.readlines()]\n",
    "\n",
    "m = sorted(m, key=lambda x:x[0])\n",
    "\n",
    "# for i in range(n):\n",
    "#     for j in range(n - i - 1):\n",
    "        # if m[i][0] < m[j][0]:\n",
    "        #     m[j], m[i] = m[i], m[j]\n",
    "        # elif m[i][0] == m[j][0] and m[i][1] < m[j][1]:\n",
    "        #     m[j], m[i] = m[i], m[j]\n",
    "        # if (m[j][1] - m[j][0]) > (m[j+1][1] - m[j+1][0]):\n",
    "        #     m[j], m[j+1] = m[j+1], m[j]\n",
    "\n",
    "# m = sorted(m)\n",
    "\n",
    "print(k, n, m[:5])\n",
    "\n",
    "t = [[0] * 1441 for _ in range(k)]\n",
    "ans = [0, None]\n",
    "\n",
    "for p in m:\n",
    "    # print(p)\n",
    "    for i in range(k):\n",
    "        if t[i][p[0] - 1] == 0:\n",
    "            # print('Use ', i)\n",
    "            ans[0] += 1\n",
    "            ans[1] = i + 1\n",
    "            j = p[0]\n",
    "            while j < p[1]:\n",
    "                t[i][j] += 1\n",
    "                j += 1\n",
    "            break\n",
    "# pp(t)\n",
    "\n",
    "ans[0], ans[1]"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**№ 7602 Досрочная волна 2023 (Уровень: Средний)**\n",
    "В аэропорту есть камера хранения из K ячеек, которые пронумерованы с 1. Принимаемый багаж кладется в свободную ячейку с минимальным номером. Известно время, когда пассажиры сдают и забирают багаж (в минутах с начала суток). Ячейка доступна для багажа, начиная со следующей минуты, после окончания срока хранения. Если свободных ячеек не находится, то багаж не принимается в камеру хранения.\n",
    "\n",
    "Найдите количество багажа, которое будет сдано в камеры за 24 часа и номер ячейки, в которую сдаст багаж последний пассажир.\n",
    "\n",
    "Входные данные\n",
    "\n",
    "В первой строке входного файла находится число K – количество ячеек в камере хранения, во второй строке файла число N – количество пассажиров, сдающих багаж (натуральное число, не превышающее 1000). Каждая из следующих N строк содержит два натуральных числа, не превышающих 1440: время сдачи багажа и время выдачи багажа.\n",
    "\n",
    "\n",
    "\n",
    "Выходные данные\n",
    "\n",
    "Программа должна вывести два числа: количество сданных в камеру хранения багажа и номер ячейки, в которую примут багаж у последнего пассажира, который сможет сдать багаж. \n",
    "\n",
    "\n",
    "\n",
    "Типовой пример организации данных:\n",
    "\n",
    "2\n",
    "\n",
    "5\n",
    "\n",
    "30 60\n",
    "\n",
    "40 60\n",
    "\n",
    "50 1110\n",
    "\n",
    "61 1010\n",
    "\n",
    "1100 1440\n",
    "\n",
    "\n",
    "\n",
    "Для указанного примера багаж смогут сдать первый, второй, четвёртый и пятый пассажир. Последний пассажир сдаст свой багаж в ячейку один, так как к этому моменту первая и вторая ячейка будут свободны."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(585, 1)"
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "f = open('26_7602.txt')\n",
    "\n",
    "# k, n = list(map(int, f.readline().split()))\n",
    "k = int(f.readline())\n",
    "n = int(f.readline())\n",
    "m = [list(map(int, i.split())) for i in f.readlines()]\n",
    "\n",
    "m = sorted(m, key=lambda x:x[0])\n",
    "\n",
    "# print(k, n, m[:5])\n",
    "\n",
    "t = [[0] * 1441 for _ in range(k)]\n",
    "ans = [0, None]\n",
    "\n",
    "for p in m:\n",
    "    # print(p)\n",
    "    for i in range(k):\n",
    "        if t[i][p[0]] == 0:\n",
    "            # print('Use ', i)\n",
    "            ans[0] += 1\n",
    "            ans[1] = i + 1\n",
    "            j = p[0]\n",
    "            while j < p[1]:\n",
    "                t[i][j] += 1\n",
    "                j += 1\n",
    "            break\n",
    "# pp(t)\n",
    "\n",
    "ans[0], ans[1]"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
