{"cells":[{"attachments":{},"cell_type":"markdown","metadata":{},"source":["**№ 7627 Досрочная волна 2023 (Уровень: Базовый)**\n","\n","Метеорологическая станция ежеминутно снимали показания прибора в течение N минут (N – целое число), которое измеряет количество осадков в условных единицах за минуту, предшествующую снятию показаний. Необходимо найти максимальную сумму двух показаний, между которыми прошло не менее K минут.\n","\n","Входные данные\n","\n","Даны два входных файла (файл A и файл B), каждый из которых\n","\n","в первой строке содержит число K – минимальное время, которое должно пройти между двумя снятиями показаний. Во второй строке число N (1 ≤ N ≤ 10 000 000, N > K) – количество измерений показателя. В каждой из следующих N строк находятся одно число: количество осадков (все числа неотрицательные, не превышающие 10 000 000). Числа указаны в порядке снятия показаний прибора, начиная с первой минуты.\n","\n","В ответе укажите два числа: сначала значение искомой величины для файла А, затем – для файла B.\n","\n","Типовой пример организации данных во входном файле\n","\n","3\n","\n","5\n","\n","15\n","\n","2\n","\n","0\n","\n","10\n","\n","30\n","\n","При таких исходных данных, когда минимальное время между двумя снятиями показаний составляет 3 минуты, максимальная сумма показаний равна 45.\n","\n","Типовой пример имеет иллюстративный характер. Для выполнения задания используйте данные из прилагаемых файлов.\n","\n","Предупреждение: для обработки файла B не следует использовать переборный алгоритм, вычисляющий сумму для всех возможных вариантов, поскольку написанная по такому алгоритму программа будет выполняться слишком долго.\n","\n","Файлы к заданию:27_A.txt 27_B.txt"]},{"cell_type":"code","execution_count":null,"metadata":{},"outputs":[],"source":["from tqdm import trange\n","\n","f = open('27_B_7627.txt')\n","k = int(f.readline())\n","n = int(f.readline())\n","m = list(map(int, f.readlines()))\n","\n","ans = 0\n","for k1 in trange(k, n-1):\n","    for i in trange(n - k1 - 1, leave=False):\n","        ans = max(ans, m[i] + m[i+k1+1])\n","\n","print(ans)\n"]},{"cell_type":"code","execution_count":24,"metadata":{},"outputs":[{"name":"stderr","output_type":"stream","text":["100%|██████████| 3000000/3000000 [00:01<00:00, 1754681.71it/s]"]},{"name":"stdout","output_type":"stream","text":["18469835\n"]},{"name":"stderr","output_type":"stream","text":["\n"]}],"source":["f = open('27_B_7627.txt')\n","k = int(f.readline())\n","n = int(f.readline())\n","m = list(map(int, f.readlines()))\n","\n","l = m.copy()\n","r = m.copy()\n","\n","for i in range(n-1):\n","    if l[i] > l[i+1]:\n","        l[i+1] = l[i]\n","\n","for i in reversed(range(1, n)):\n","    if r[i] > r[i-1]:\n","        r[i-1] = r[i]\n","\n","ans = 0\n","for i in trange(n - k):\n","        ans = max(ans, l[i] + r[i+k])\n","\n","print(ans)"]},{"attachments":{},"cell_type":"markdown","metadata":{},"source":["\t\n","**№ 7856 Danov2304 (Уровень: Базовый)**\n","(А.Богданов) Дана последовательность натуральных чисел. Найдите пару с максимальной суммой, между элементами которой есть один или более элементов с суммой кратной К. В ответе укажите максимальную сумму пары для фала А и файла В.\n","\n","Входные данные: по одному числу на строке К, N и далее N натуральных чисел.\n","\n","Пример:\n","\n","10\n","6\n","9\n","1\n","4\n","7\n","3\n","8 \n","\n","Ответом будет 4+8=12: [4 (7+3 :10) 8]"]},{"cell_type":"code","execution_count":73,"metadata":{},"outputs":[{"ename":"KeyboardInterrupt","evalue":"","output_type":"error","traceback":["\u001b[0;31m---------------------------------------------------------------------------\u001b[0m","\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)","Cell \u001b[0;32mIn[73], line 9\u001b[0m\n\u001b[1;32m      5\u001b[0m n \u001b[39m=\u001b[39m \u001b[39mint\u001b[39m(f\u001b[39m.\u001b[39mreadline())\n\u001b[1;32m      6\u001b[0m m \u001b[39m=\u001b[39m \u001b[39mlist\u001b[39m(\u001b[39mmap\u001b[39m(\u001b[39mint\u001b[39m, f\u001b[39m.\u001b[39mreadlines()))\n\u001b[0;32m----> 9\u001b[0m ost \u001b[39m=\u001b[39m [\u001b[39msum\u001b[39m(m[:i\u001b[39m+\u001b[39m\u001b[39m1\u001b[39m]) \u001b[39m%\u001b[39m k \u001b[39mfor\u001b[39;00m i \u001b[39min\u001b[39;00m \u001b[39mrange\u001b[39m(n\u001b[39m-\u001b[39m\u001b[39m1\u001b[39m)]\n\u001b[1;32m     11\u001b[0m \u001b[39m# print(ost[:5])\u001b[39;00m\n\u001b[1;32m     13\u001b[0m p \u001b[39m=\u001b[39m []\n","Cell \u001b[0;32mIn[73], line 9\u001b[0m, in \u001b[0;36m<listcomp>\u001b[0;34m(.0)\u001b[0m\n\u001b[1;32m      5\u001b[0m n \u001b[39m=\u001b[39m \u001b[39mint\u001b[39m(f\u001b[39m.\u001b[39mreadline())\n\u001b[1;32m      6\u001b[0m m \u001b[39m=\u001b[39m \u001b[39mlist\u001b[39m(\u001b[39mmap\u001b[39m(\u001b[39mint\u001b[39m, f\u001b[39m.\u001b[39mreadlines()))\n\u001b[0;32m----> 9\u001b[0m ost \u001b[39m=\u001b[39m [\u001b[39msum\u001b[39m(m[:i\u001b[39m+\u001b[39m\u001b[39m1\u001b[39m]) \u001b[39m%\u001b[39m k \u001b[39mfor\u001b[39;00m i \u001b[39min\u001b[39;00m \u001b[39mrange\u001b[39m(n\u001b[39m-\u001b[39m\u001b[39m1\u001b[39m)]\n\u001b[1;32m     11\u001b[0m \u001b[39m# print(ost[:5])\u001b[39;00m\n\u001b[1;32m     13\u001b[0m p \u001b[39m=\u001b[39m []\n","\u001b[0;31mKeyboardInterrupt\u001b[0m: "]}],"source":["import tqdm\n","\n","f = open('27B_7856.txt')\n","k = int(f.readline())\n","n = int(f.readline())\n","m = list(map(int, f.readlines()))\n","\n","\n","ost = [sum(m[:i+1]) % k for i in range(n-1)]\n","\n","# print(ost[:5])\n","\n","p = []\n","for i in range(k):\n","    p1 = [j for j in range(n-1) if ost[j] == i]\n","    if len(p1) > 1: \n","        p += [p1]\n","\n","# print(p[:10])\n","\n","ans = 0\n","for a in tqdm.tqdm(p):\n","    for i in range(len(a)-1):\n","        for j in range(i, len(a)):\n","            ans = max(ans, m[a[i]] + m[a[j]+1])\n","\n","ans\n"]},{"cell_type":"code","execution_count":70,"metadata":{},"outputs":[{"data":{"text/plain":["12"]},"execution_count":70,"metadata":{},"output_type":"execute_result"}],"source":["ans = 0\n","for i in range(n-2):\n","    for j in range(i+2, n):\n","        if sum(m[i+1:j]) % k == 0:\n","            ans = max(ans, m[i] + m[j])\n","\n","ans"]},{"cell_type":"code","execution_count":71,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["[9, 0, 4, 1, 4]\n"]},{"name":"stderr","output_type":"stream","text":["100%|██████████| 4/4 [00:00<00:00, 25811.10it/s]\n"]},{"data":{"text/plain":["12"]},"execution_count":71,"metadata":{},"output_type":"execute_result"}],"source":["ost = [sum(m[:i+1]) % k for i in range(n-1)]\n","print(ost)\n","par = []\n","for i in trange(n-2):\n","    for j in range(i+1, n-1):\n","        if ost[i] == ost[j]:\n","            par += [[m[i], m[j+1]]]\n","\n","\n","sum(max(par, key=lambda x: x[0] + x[1]))"]}],"metadata":{"kernelspec":{"display_name":"Python 3","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.10.6"},"orig_nbformat":4},"nbformat":4,"nbformat_minor":2}
